webservices/RentACarWebServices/resources/registerAccountRq.xml

<?xml version="1.0"?>
<SOAP-ENV:Envelope SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/1999/XMLSchema" xmlns:xsi="http://www.w3.org/1999/XMLSchema-instance">
   <SOAP-ENV:Body>
      <m:registerAccount xmlns:m="http://paymentsimulator.alicnina.com">
		<m:creditCardNo>1234567</m:creditCardNo>
		<m:cvv2>123</m:cvv2>
		<m:ammount>123.123</m:ammount>
	 </m:registerAccount>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>